# IsAlmostEqualTo Method (XYZ) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
XYZ..::..IsAlmostEqualTo Method (XYZ)
XYZ Class See Also
---
Determines whether this vector and the specified vector are the same within the tolerance (1.0e-09).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsAlmostEqualTo(
	XYZ source
)
```

Visual Basic
---
```text
Public Function IsAlmostEqualTo ( _
	source As XYZ _
) As Boolean
```

Visual C++
---
```text
public:
bool IsAlmostEqualTo(
	XYZ^ source
)
```

# ### Parameters
source
    Type: Autodesk.Revit.DB..::..XYZThe vector to compare with this vector.
# ### Return Value
True if the vectors are the same; otherwise, false.
# Remarks
This routine uses Revit's default tolerance to compare two vectors to see if they are almost equivalent. Because the tolerance is small enough this can also be used to compare two points.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when source is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
XYZ Class
IsAlmostEqualTo Overload
Autodesk.Revit.DB Namespace